/* ---------------------REXX-------------------------------- *
* Exercise 1 Solution *
* --------------------------------------------------------- */
say "Current System Name: " mvsvar('sysname')
say "Current System Level:" mvsvar('sysmvs')
