/* ---------------------REXX-------------------------------- *
* Exercise 2 Solution *
* --------------------------------------------------------- */
parse arg command options
Say "Command:" command
Say "Options:" options
command options
